Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: #Hotstring c0 ; Make all hotstrings below this point case insensitive.
ja: #Hotstring c0 ; これより下のホットストリングはすべて大文字小文字を区別しないようにします。

source: #Hotstring c0 ; Make all hotstrings below this point case-insensitive.
ja: #Hotstring c0 ; これ以下のホットストリングは、大文字と小文字を区別しなくなります。

source: #Hotstring r c ; All the below hotstrings will use "send raw" and will be case sensitive by default.
ja: #Hotstring r c ; 以下のホットストリングはすべて "send raw"を使用し、デフォルトで大文字と小文字が区別されます。

source: #Hotstring r c ; All the below hotstrings will use "send raw" and will be case-sensitive by default.
ja: #Hotstring r c ; これ以下のホットストリングは、「send raw」を使い、大文字と小文字を区別するようになります。

source: #IfWinActive, #IfWinExist, #IfWinNotActive, #IfWinNotExist (see #HotIf Optimization)
ja: #IfWinActive、#IfWinExist、#IfWinNotActive、#IfWinNotExist（#HotIf Optimization参照）

source: #Include
ja: #Includeディレクティブ

source: #Include "SomeFile.ahk" ; This line takes effect regardless of the value of x.
ja: #Include "SomeFile.ahk" ; この行は、xの値に関係なく有効になります。

source: #Include / #IncludeAgain - Syntax & Usage | AutoHotkey v2
ja: #Include / #IncludeAgain - 構文と使用法｜AutoHotkey v2

source: #Include ensures that FileName is included only once, even if multiple inclusions are encountered for it.
ja: #Includeは、FileNameに対して複数のインクルードが発生しても、FileNameが一度だけインクルードされることを保証します。

source: #Include is often used to load functions defined in an external file.
ja: #Includeは、外部ファイルで定義された関数を読み込むためによく使われます。

source: #InputLevel - Syntax & Usage | AutoHotkey v2
ja: #InputLevel - 構文と使用法｜AutoHotkey v2

source: #InstallKeybdHook (use the InstallKeybdHook function)
ja: #InstallKeybdHook（InstallKeybdHook関数を使用）

source: #InstallMouseHook (use the InstallMouseHook function)
ja: #InstallMouseHook（InstallMouseHook関数を使用）

source: #KeyHistory (use KeyHistory N)
ja: #KeyHistory （KeyHistory Nを使用します）

source: #MaxHotkeysPerInterval (use A_MaxHotkeysPerInterval)
ja: #MaxHotkeysPerInterval （A_MaxHotkeysPerIntervalを使用します）

source: #MaxMem (maximum capacity of each variable is now unlimited)
ja: #MaxMem（各変数の最大容量が無制限になりました）

source: #MaxMem was removed, and no artificial limit is placed on variable capacity.
ja: #MaxMem が削除され、可変容量に人為的な制限がかからなくなりました。

source: #MaxThreads - Syntax & Usage | AutoHotkey v2
ja: #MaxThreads - 構文と使用法｜AutoHotkey v2

source: #MaxThreadsBuffer - Syntax & Usage | AutoHotkey v2
ja: #MaxThreadsBuffer - 構文と使用法｜AutoHotkey v2

source: #MaxThreadsPerHotkey - Syntax & Usage | AutoHotkey v2
ja: #MaxThreadsPerHotkey - 構文と使用法｜AutoHotkey v2

source: #MenuMaskKey (use A_MenuMaskKey)
ja: #MenuMaskKey （A_MenuMaskKeyを使用します）

source: #NoEnv (now default behaviour)
ja: #NoEnv（現在のデフォルトの動作）

source: #NoEnv is the default behaviour, so the directive itself has been removed.
ja: #NoEnv はデフォルトの動作なので、ディレクティブ自体が削除されました。

source: #NoTrayIcon - Syntax & Usage | AutoHotkey v2
ja: #NoTrayIcon - 構文と使用法｜AutoHotkey v2

source: #Persistent was used.
ja: #Persistent を使用しました。

source: #Requires - Syntax & Usage | AutoHotkey v2
ja: #Requires - 構文と使用法｜AutoHotkey v2

source: #SingleInstance - Syntax & Usage | AutoHotkey v2
ja: #SingleInstance - 構文と使用法｜AutoHotkey v2

source: #Space::Run A_ScriptDir ; An additional Ctrl keystroke is not triggered.
ja: #Space::Run A_ScriptDir ; 追加のCtrlキー操作は発生しません。

source: #SuspendExempt ; Exempt the following hotkey from Suspend.
ja: #SuspendExempt ; 以下のホットキーをSuspendから除外します。

source: #SuspendExempt - Syntax & Usage | AutoHotkey v2
ja: #SuspendExempt - 構文と使用法｜AutoHotkey v2

source: #SuspendExempt False ; Disable exemption for any hotkeys/hotstrings below this.
ja: #SuspendExempt False ; これより下のホットキー/ホットストリングの例外を無効にします。

source: #UseHook ; Force the use of the hook for hotkeys after this point.
ja: #UseHook ; この時点以降、ホットキーにフックを使用することを強制します。

source: #UseHook - Syntax & Usage | AutoHotkey v2
ja: #UseHook - 構文と使用法｜AutoHotkey v2

source: #Warn - Syntax & Usage | AutoHotkey v2
ja: #Warn - 構文と使用法｜AutoHotkey v2

source: #Warn ClassOverwrite has been removed, as top-level classes can no longer be overwritten by assignment.
ja: トップレベルのクラスが割り当てによって上書きされることがなくなったため、#Warn ClassOverwriteは削除されました。

source: #Warn UseUnsetLocal and UseUnsetGlobal have been removed, as reading an unset variable now raises an error.
ja: 設定されていない変数を読み込むとエラーが発生するようになったため、#Warn UseUnsetLocal と UseUnsetGlobal は削除されました。

source: #WinActivateForce - Syntax & Usage | AutoHotkey v2
ja: #WinActivateForce - 構文と使用法｜AutoHotkey v2

source: #c::Send "{vkFFsc159}" ; See Send {vkXXscYYY} for more details.
ja: #c::Send "{vkFFsc159}" ; 詳しくは Send {vkXXscYYY} をご覧ください。

source: #c::SystemCursor("Toggle") ; Win+C hotkey to toggle the cursor on and off.
ja: #c::SystemCursor("Toggle") ; Win+CホットキーでカーソルのON/OFFを切り替えられます。

source: #n:: ; Press Win-N to run Notepad.
ja: #n:: ; Win-Nを押してメモ帳を起動します。

source: #n::WinActivate ; Activates the window found by WinExist().
ja: #n::WinActivate ; WinExist()で見つかったウィンドウをアクティブにします。

source: #n::MsgBox ThisHotkey ; Reports #n
ja: #n::MsgBox ThisHotkey ; レポート #n

source: #o:: ; Win+O hotkey
ja: #o:: ; Win+O

source: #p::Pause -1 ; Win+P
ja: #p::Pause -1 ; Windowsキー+P

source: #space:: ; Win+Space hotkey.
ja: #space:: ; Win+Space ホットキー。

source: #w::Run "wordpad" ; Press Win-W to run Wordpad.
ja: #w::Run "wordpad" ; Win-Wを押してWordpadを実行します。

source: #z:: ; Win+Z hotkey (change this hotkey to suit your preferences).
ja: #z:: ; Win+Zのホットキー（このホットキーはお好みで変更してください）。

source: #z:: ; Win+Z hotkey
ja: #z:: ; Win+Z

source: #z::MyMenu.Show ; i.e. press the Win-Z hotkey to show the menu.
ja: #z::MyMenu.Show ; つまり、Win-Zホットキーを押してメニューを表示する。

source: #z::MyMenu.Show() ; i.e. press the Win-Z hotkey to show the menu.
ja: #z::MyMenu.Show() ; つまり、Win-Zホットキーを押してメニューを表示する。

source: %val3% := 1.1 ; % is used because & was omitted.
ja: %val3% := 1.1 ; & が省略されているため、% が使用されています。

source: 'Seek' lets you specify a case-insensitive key word/phrase that it will use to filter only the matching programs and directories from the Start Menu, so that you can easily open your target program from a handful of matched entries.
ja: 'Seek'では、大文字と小文字を区別しないキーワードを指定することができ、それを使ってスタートメニューから一致するプログラムやディレクトリだけを絞り込むことができるため、一致したエントリーの中から目的のプログラムを簡単に開くことができる。

source: (1) copyright the software, and (2) offer you this license which gives you legal permission to copy, distribute and/or modify the software.
ja: (1) 本ソフトウェアの著作権、(2) 本ソフトウェアを複製、頒布、および/または変更する法的許可を与える本ライセンスの提供。

source: (\.[^\.]+$~.exe means scan for a . followed by 1 or more non-. characters followed by end-of-string, and replace them with .exe)
ja: （\.[^\.]+$~.exeは、.の後に.以外の文字が1文字以上続くか、文字列の末尾が.exeであるかをスキャンし、.exeに置き換えることを意味する）

source: (A statement is simply the smallest standalone element of the language that expresses some action to be carried out.) The exception to this is line continuation (see below).
ja: （ステートメントとは、単に実行されるべき何らかの動作を表現する、言語の最小の独立した要素です。） ただし、行の継続は例外です（下記参照）。

source: (Additional scripts can be added with the AddResource compiler directive.) This allows the compiled script .exe to be used with the /script switch to execute scripts other than the main embedded script.
ja: （追加のスクリプトはAddResourceコンパイラディレクティブで追加できます。） これにより、コンパイルされたスクリプト.exeを/scriptスイッチで使用し、メインの埋め込みスクリプト以外のスクリプトを実行することができます。

source: (After invoking the GUI, there may be a pause before the window is shown; see Background Information for more details.)
ja: （GUIを起動した後、ウィンドウが表示されるまで一時停止することがある。詳細は背景情報を参照。）

source: (Also see UseResourceLang below)
ja: （以下のUseResourceLangも参照）

source: (Also see the Base directive.) This directive may be overridden by an output file specified in the GUI or CLI.
ja: （Baseディレクティブも参照してください。） このディレクティブは、GUIやCLIで指定された出力ファイルによって上書きされることがあります。

source: (Blank)
ja: （ブランク）

source: (Blank) and Text sub-commands
ja: （ブランク）およびテキストサブコマンド

source: (Broken by v2.0.4)
ja: （v2.0.4で生じた不具合）

source: (Broken by v2.0.6)
ja: （v2.0.6で生じた不具合）

source: (Class objects are used in place of constructor functions.)
ja: （クラス・オブジェクトはコンストラクタ関数の代わりに使われる。）

source: (Controls are rendered only inside the client area.)
ja: （コントロールはクライアントエリア内でのみレンダリングされます。）

source: (Exception:
ja: (例外：

source: (Exception: if the Program itself is interactive but does not normally print such an announcement, your work based on the Program is not required to print an announcement.)
ja: （例外：もし『プログラム』自体が対話的であっても、通常そのようなアナウンスを印刷しないのであれば、『プログラム』に基づくあなたの作品はアナウンスを印刷する必要はありません。）

source: (For associative arrays in v1, only a method call can cause this.)
ja: （v1の連想配列の場合、メソッド呼び出しでのみ発生します。）

source: (For example, match.Len always returns the length of the overall match, not a captured string.)
ja: （例えば、match.Lenは常にマッチ全体の長さを返し、キャプチャした文字列は返しません。）

source: (For further explanation of surrogate pairs and methods of encoding or decoding them, search the Internet.)
ja: （サロゲートペアやその符号化・復号化の方法については、インターネットで検索してください。）

source: (For historical reasons, command may refer to a particular style of calling a function, where the parentheses are omitted and the return value is discarded.
ja: （歴史的な理由から、コマンドは、括弧が省略され、戻り値が破棄される、関数を呼び出す特定のスタイルを指す場合があります。

source: (For the full list of symbols, see the Hotkey page)
ja: （記号の全リストはホットキーのページを参照）

source: (Hereinafter, translation is included without limitation in the term "modification".) Each licensee is addressed as "you".
ja: （以下、翻訳を「修正」という用語に無制限に含める。） 各ライセンシーは、「お客様」として扱われます。

source: (However, it still searches right-to-left if StartingPos is negative and Occurrence is omitted.) This facilitates right-to-left searches in a loop, and allows a negative StartingPos to be used while still searching left-to-right.
ja: （ただし、StartingPosが負でOccurrenceが省略された場合は、右から左に検索されます。） これにより、ループ内での右から左への検索が容易になり、負のStartingPosを使用しても、左から右への検索が可能になります。

source: (However, the changes to scope described below mitigate most issues arising from this.) For a list of classes, see Built-in Classes.
ja: （ただし、後述するスコープの変更により、このことから生じる問題はほとんど緩和されます。） クラスの一覧は、「組み込みクラス」を参照してください。

source: (However, they can now be implicitly shadowed by a local variable; that can be detected by #Warn LocalSameAsGlobal.)
ja: （ただし、ローカル変数によって暗黙的にシャドウされることができるようになりました。これは#Warn LocalSameAsGlobalで検出できます。）

source: (However, you can delete an object's properties, content or associated resources, such as an Array's elements, the window associated with a Gui, the items of a Menu object, and so on.)
ja: ただし、配列の要素、Guiに関連付けられたウィンドウ、Menuオブジェクトの項目など、オブジェクトのプロパティ、コンテンツ、または関連リソースは削除できます。

source: (However, you can delete an object's properties, content or associated resources, such as an Array's elements, the window associated with a Gui, the menu of a Menu object, and so on.)
ja: (ただし、Arrayの要素、Guiに関連するウィンドウ、Menuオブジェクトのメニューなど、オブジェクトのプロパティ、コンテンツ、関連リソースを削除することは可能です)。

source: (Ideally this would be done for any implicit conversion from object to string, but the current implementation makes this difficult.)
ja: （理想的には、オブジェクトから文字列への暗黙の変換でも行われるのですが、現在の実装ではこれが困難です。）

source: (If an actual comment is appended to this directive, it must use the ; flag.
ja: （このディレクティブに実際のコメントを付加する場合は、;フラグを使用しなければならない。

source: (In comparison to DllCall, NumPut's input parameters correspond to the dll function's parameters, while NumGet's return type parameter corresponds to the dll function's return type string.)
ja: （DllCallと比較して、NumPutの入力パラメータはdll関数のパラメータに対応し、NumGetの戻り型パラメータはdll関数の戻り型文字列に対応します。）

source: (Note that the .exe will contain binary data.)
ja: （。exeにはバイナリデータが含まれることに注意。）

source: (Note that the use of a Buffer object may be preferred; in particular, when dealing with non-Unicode strings.)
ja: （特にUnicode以外の文字列を扱う場合は、Bufferオブジェクトを使用する方が好ましいかもしれないことに注意してください。）

source: (Numeric strings are okay.)
ja: （数値文字列でも可。）

source: (Objects are always considered true.)
ja: （オブジェクトは常に真とみなされます。）

source: (Optional) The name of the file to be kept open for the duration of the loop, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: （オプション）ループの間、開いておくファイルの名前。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定される。

source: (RegDelete now only deletes values, except when omitting all parameters in a registry loop.)
ja: （RegDeleteは、レジストリループですべてのパラメータを省略する場合を除き、値のみを削除するようになりました。）

source: (Scripts should begin with a Unicode byte-order-mark (BOM), rendering the use of this parameter unnecessary.)
ja: （スクリプトはユニコードのバイトオーダーマーク（BOM）で始まるはずなので、このパラメータの使用は不要です。）

source: (See RegEx Quick Reference.) Note that p3 is optional.
ja: （RegExクイックリファレンス参照。） p3はオプションであることに注意。

source: (See Version below, for more details.)
ja: （詳細は下記バージョンを参照。）

source: (See the RegEx example below for more information.)
ja: （詳細は以下のRegExの例を参照。）

source: (Some other Free Software Foundation software is covered by the GNU Lesser General Public License instead.) You can apply it to your programs, too.
ja: （他のいくつかのFree Software Foundationソフトウェアは、代わりにGNU劣等一般公衆ライセンスが適用されます。） あなたのプログラムにも適用できます。

source: (The {1} in the first regex was changed to {3} in the second regex to select after the third " to extract the company name.)
ja: （最初の正規表現の{1}は2番目の正規表現の{3}に変更され、会社名を抽出するために3番目の"の後を選択する。）

source: (The caller may or may not show an additional error dialog without any specific details.) This also applies to event handlers being called due to the use of ComObjConnect.
ja: （呼び出し側は、具体的な詳細を伴わない追加のエラーダイアログを表示することも、しないこともあります。） これは、ComObjConnectの使用により呼び出されるイベントハンドラにも適用されます。

source: (The global nature of built-in variables means that an Enumerator function could set the index to be seen by a For loop.)
ja: （組み込み変数のグローバルな性質は、Enumerator関数がForループで見るべきインデックスを設定できることを意味します。）

source: (The previous behaviour was to cycle through every owned window and never activate the owner.)
ja: （以前の動作は、所有するすべてのウィンドウを循環させ、所有者を起動させることはありませんでした。）

source: (The two clicks must also occur within a specified time.)
ja: （この2回のクリックは指定された時間内に行われなければならない。）

source: (There are other examples mentioned in the BinMod.ahk script.)
ja: （BinMod.ahkスクリプトには他にも例がある。）

source: (These windows are generally also omitted from Alt-Tab and the taskbar.)
ja: （これらのウィンドウは、一般的にAlt-Tabやタスクバーも省略されます。）

source: (This alternative is allowed only for noncommercial distribution and only if you received the program in object code or executable form with such an offer, in accord with Subsection b above.)
ja: （この選択肢は、非商業的な頒布に限り許可されます。また、あなたが上記第b項に従い、そのような申し出と共にオブジェクト・コードか実行可能形式のプログラムを受け取った場合に限ります。）

source: (This behaviour was added in Revision 31 and broken by v1.1.30.00.)
ja: （この動作はリビジョン31で追加され、v1.1.30.00で壊れました。）

source: (This change reduced code size marginally as it was already permitted by local and global.)
ja: （この変更は、localと globalですでに許可されていたため、コードサイズをわずかに減らすことができました。）

source: (This does not apply to built-in classes such as Object; they are predefined as global variables.)
ja: （Objectなどの組み込みクラスはグローバル変数としてあらかじめ定義されているので、この限りではありません。）

source: (This example is only for illustration because it would be easier to use the built-in remapping feature.) In the following hotkey, the mouse button is kept held down while NumpadAdd is down, which effectively transforms NumpadAdd into a mouse button.
ja: （内蔵のリマッピング機能を使った方が簡単なので、この例は説明のためだけです。） 次のホットキーでは、NumpadAddが押されている間、マウスボタンが押されたままになっており、NumpadAddが効果的にマウスボタンに変換されています。

source: (This parameter can be overridden by the ExeName directive.)
ja: (このパラメータはExeNameディレクティブで上書きすることができます)。

source: (This prevents simulated keystrokes and mouse clicks from falsely indicating that a user is present.) If neither hook is installed, this variable is equivalent to A_TimeIdle.
ja: （これにより、シミュレートされたキーストロークやマウスクリックが、 ユーザーが存在することを誤って示すのを防ぐことができる。） どちらのフックもインストールされていない場合、この変数はA_TimeIdleと等価である。

source: (To change the other icons, see the AddResource example.) This directive may be overridden by an icon file specified in the GUI or CLI.
ja: （他のアイコンを変更するには、AddResourceの例を参照のこと。） このディレクティブは、GUIまたはCLIで指定されたアイコンファイルによって上書きされることがある。

source: (Unlike the others, they do not actually support expressions.)
ja: （他と違い、実際には表現に対応していません。）

source: (all parameters omitted)
ja: (全パラメータ省略)

source: (like System Modal but omits title bar icon)
ja: （システムモーダル同様、タイトルバーアイコンが省略されています）

source: (parameter omitted)
ja: (パラメタ省略)

source: (requires the Help button to be present)
ja: （ヘルプボタンがあることが必要です）

source: (suffix)
ja: （接尾）

source: (v1.1.28+ Unicode builds already use this method.) The fallback methods of detecting AltGr via the keyboard hook have been removed.
ja: （v1.1.28+のUnicodeビルドでは既にこの方法が使われています。） キーボードフックでAltGrを検出するフォールバックメソッドは削除されました。

source: )", "Window Title", "iconi"
ja: )", "ウィンドウタイトル", "iconi"

source: * or P
ja: *またはP

source: *#c::Run "calc.exe" ; Win+C, Shift+Win+C, Ctrl+Win+C, etc. will all trigger this hotkey.
ja: *#c::Run "calc.exe" ; Win+C、Shift+Win+C、Ctrl+Win+Cなど、すべてこのホットキーがトリガーされます。

source: *F1::Send "{Alt down}{tab}" ; Asterisk is required in this case.
ja: *F1::Send "{Alt down}{tab}" ; この場合、アスタリスクが必要です。

source: *MButton::Send "{Blind}{Escape}" ; The * prefix allows it to fire whether or not Alt is held down.
ja: *MButton::Send "{Blind}{Escape}" ; Altが押されていても押されていなくても発射されるように、*の接頭辞を付けています。

source: *ScrollLock::Run "notepad" ; Pressing ScrollLock will trigger this hotkey even when modifier key(s) are down.
ja: *ScrollLock::Run "notepad" ; 修飾キーが押されていても、ScrollLockを押すとこのホットキーが起動します。

source: +/-Background is interpreted and supported more consistently.
ja: +/-Background は、解釈とサポートがより一貫しています。

source: +/-Left or +/-Right.
ja: +/-Leftまたは+/-Right。

source: +/-Simple (ComboBox only).
ja: +/-Simple（ComboBoxのみ）。

source: +/-Wrap for multi-line edits, and +/-Limit for single-line edits.
ja: 複数行の編集には+/-Wrap、1行の編集には+/-Limit。

source: +HwndOutputVar (use Gui.Hwnd or GuiControl.Hwnd instead)
ja: +HwndOutputVar（Gui.Hwnd または GuiControl.Hwnd を代わりに使用してください）

source: +HwndOutputVar (use GuiObj.Hwnd or GuiCtrl.Hwnd instead)
ja: +HwndOutputVar (GuiObj.Hwnd または GuiCtrl.Hwnd を代わりに使用してください。)

source: +Right (i.e. +Right includes both BS_RIGHT and BS_RIGHTBUTTON, but -Right removes only BS_RIGHT, not BS_RIGHTBUTTON).
ja: +Right（すなわち、+RightはBS_RIGHTと BS_RIGHTBUTTONの両方を含むが、-RightはBS_RIGHTのみを削除し、BS_RIGHTBUTTONは削除しない）。

source: , "Ptr", WindowProcNew, "Ptr") ; Return value must be set to "Ptr" or "UPtr" vs. "Int".
ja: , "Ptr", WindowProcNew, "Ptr") ; 戻り値は「Ptr」または「UPtr」対「Int」に設定する必要があります。

source: , "Uint", 0, "Ptr", sfi, "UInt", sfi_size, "UInt", 0x101) ; 0x101 is SHGFI_ICON+SHGFI_SMALLICON
ja: , "Uint", 0, "Ptr", sfi, "UInt", sfi_size, "UInt", 0x101) ; 0x101 は、 SHGFI_ICON+SHGFI_SMALLICON

source: -1 = Call the callback before any previously registered callbacks.
ja: -1 = 以前に登録されたコールバックより先にコールバックを呼び出します。

source: -1 = Call the function before any previously registered functions.
ja: -1 = 過去に登録された機能よりも先に機能を呼び出します。

source: -1 = The window is minimized.
ja: -1 = ウィンドウが最小化されます。

source: -1: The window is minimized (WinRestore can unminimize it).
ja: -1：ウィンドウが最小化されています（WinRestoreは最小化を解除できます）。

source: -1: no angle to report
ja: -1：触れない

source: ... Just kidding.
ja: ……冗談だよ。

source: .NET Framework libraries are executed by a "virtual machine" known as the Common Language Runtime, or CLR.
ja: .NET Frameworkのライブラリは、Common Language Runtime（CLR）と呼ばれる「仮想マシン」によって実行されます。

source: .Text or SB.SetText()
ja: .Text または SB.SetText()

source: /* This is also valid, but no other code can share the line.
ja: /* これも有効ですが、他のコードがその行を共有することはできません。

source: /* and */ symbols can be used to comment out an entire section, as in this example:
ja: /* および */記号は、この例のように、セクション全体をコメントアウトするために使用することができます。

source: /* must appear at the start of the line, while */ can appear only at the start or end of a line.
ja: /* は行頭に表示する必要があります。 */は、行頭または行末にのみ表示することができます。

source: /ErrorStdOut is now treated as one of the script's parameters, not built-in, in either of the following cases:
ja: 以下のいずれかの場合、/ErrorStdOut は組み込みではなく、スクリプトのパラメータの1つとして扱われるようになりました：

source: /Launch causes the launcher to exit immediately after launching the script.
ja: /Launch は、スクリプトを起動すると、ランチャーを直ちに終了させます。

source: /Launch causes the process ID (PID) of the newly launched script to be returned as the launcher's exit code, whereas it would normally return the launched script's exit code.
ja: 通常は起動したスクリプトの終了コードを返しますが、/Launchでは、新しく起動したスクリプトのプロセスID（PID）がランチャーの終了コードとして返されます。

source: /RunWith criteria
ja: /RunWith 基準

source: /validate should be used in place of /iLib when AutoHotkey.exe is being used to check a script for syntax errors, as the function library auto-include mechanism was removed.
ja: 関数ライブラリの自動インクルード機構が削除されたため、AutoHotkey.exeを使用してスクリプトの構文エラーをチェックする場合、/iLibの代わりに/validateを使用する必要があります。

source: 0 (IMAGE_BITMAP), 1 (IMAGE_ICON) or 2 (IMAGE_CURSOR).
ja: 0（IMAGE_BITMAP）、1（IMAGE_ICON）または2（IMAGE_CURSOR）。

source: 0 (SEEK_SET): Beginning of the file.
ja: 0（SEEK_SET）：ファイルの先頭です。

source: 0 - Only run when no compression is specified.
ja: 0 - 圧縮が指定されていない場合にのみ実行される。

source: 0 = Clipboard is now empty.
ja: 0 = クリップボードは空です。

source: 0 = Do not call the callback.
ja: 0 = コールバックを呼び出さない。

source: 0 = Do not call the function.
ja: 0 = 関数を呼び出しません。

source: 0 = Force the default options to be used.
ja: 0 = デフォルトのオプションを強制的に使用します。

source: 0 = Logoff
ja: 0 = ログオフ

source: 0 = Normal boot
ja: 0 = 通常ブート

source: 0 = The window is neither minimized nor maximized.
ja: 0 = ウィンドウは最小化も最大化もされません。

source: 0 QueryInterface -- use ComObjQuery instead
ja: 0 QueryInterface -- ComObjQueryの代わりに使用

source: 0 for the overall match.
ja: 全体の試合では0。

source: 0 if VersionA is equal to VersionB
ja: 0 は、VersionAとVersionBが等しい場合

source: 0 makes the window invisible while 255 makes it opaque.
ja: 0はウィンドウを不可視にし、255は不透明にする。

source: 0, if String1 is identical to String2
ja: 0,String1が String2と同じ場合

source: 05d}", 1) returns 0001.
ja: 05d}", 1)は 0001を返します。

source: 0: The window is neither minimized nor maximized.
ja: 0：ウィンドウは最小化も最大化もされません。

source: 0: forward POV
ja: 0：前方視線

source: 0x0111 is the hex code of wm_command message and 40239 is the code that this particular window understands as menu-item 'Insert Picture' selection.
ja: 0x0111はwm_commandメッセージの16進コードであり、40239はこの特定のウィンドウがメニュー項目の'Insert Picture'選択として理解するコードである。

source: 0x10 = Add marks for left-to-right reading order layout.
ja: 0x10 = 左から右への読み順レイアウトのためのマークを追加します。

source: 0x20 = Add marks for right-to-left reading order layout.
ja: 0x20 = 右から左への読み順レイアウトのためのマークを追加します。

source: 0x40000000 = Use the system ANSI code page for string translation instead of the locale's code page.
ja: 0x40000000 = 文字列の変換にロケールのコードページではなく、システムのANSIコードページを使用します。

source: 0x409 English (United States)
ja: 0x411 Japanese

source: 0x80000000 = Do not obey any overrides the user may have in effect for the system's default date format.
ja: 0x80000000 = システムのデフォルトの日付フォーマットに対して、ユーザーが有効にしているオーバーライドに従わない。

source: 0x80000000 = Do not obey any overrides the user may have in effect for the system's default time format.
ja: 0x80000000 = システムのデフォルトの時間フォーマットに対して、ユーザーが有効にしているオーバーライドに従わない。

source: 1 (SEEK_CUR): Current position of the file pointer.
ja: 1（SEEK_CUR）：ファイルポインタの現在位置。

source: 1 (true) if the color should be applied to all of this menu's submenus, otherwise 0 (false).
ja: この色がこのメニューのすべてのサブメニューに適用される場合は1（真）、そうでない場合は0（偽）です。

source: 1 - Only run when MPRESS compression is specified.
ja: 1 - MPRESS 圧縮が指定されているときのみ実行される。

source: 1 - The Basics
ja: 1 - 基本

source: 1 = Call the callback after any previously registered callbacks.
ja: 1 = 以前に登録されたコールバックの後にコールバックを呼び出します。

source: 1 = Call the function after any previously registered functions.
ja: 1 = 以前に登録した機能の後に機能を呼び出します。

source: 1 = Clipboard contains something that can be expressed as text (this includes files copied from an Explorer window).
ja: 1 = クリップボードにテキストとして表現できるものが格納されています。エクスプローラーウィンドウからコピーされたファイルも含まれます。

source: 1 = Fail-safe boot
ja: 1 = フェイルセーフブート

source: 1 = Omit minutes and seconds.
ja: 1 = 分と秒を省略します。

source: 1 = Shutdown
ja: 1 = シャットダウン

source: 1 = The window is maximized.
ja: 1 = ウィンドウが最大化されます。

source: 1 = Use short date (meaningful only when Format is blank; not compatible with 2 and 8).
ja: 1 = 短い日付を使用する（Formatが空白の場合のみ意味があります）。

source: 1 AddRef -- use ObjAddRef instead
ja: 1 AddRef -- ObjAddRefの代わりに使用

source: 1 is Sunday in all locales.
ja: 1はどの地域でも日曜日。
